BLESSING_PRESET = {
    "Preservation": """
        神性构筑•宏观偏析 > 神性构筑•超静定场 > 神性构筑•谐振传递 > 景星助狩月 > 湮灭回归不等式 > 星间构筑•回馈庇护 > 星间构筑•切变结构
        > 星间构筑•亚共晶体 > 构筑•聚塑 > 星间构筑•固溶强化 > 星间构筑•迸裂晶格 > 星间构筑•四棱锥体 > 星间构筑•安全载荷 > 构筑•回转
        > 构筑•坚定 > 构筑•补偿 > 构筑•迸发 > 构筑•专注 > 构筑•弥合 > 构筑•哨戒
        > reset
        > 胜军 > 天棓步危 > 桑弧蓬矢 > 加持 > 不稳定带 > 孢夹 > 火堆外的夜 > 《冠军晚餐•猫的摇篮》 > 帝弓断空彻太清 > 云镝逐步离
        > 帝车超光所向捷 > 背生击死 > 背孤击虚 > 宝光烛日月 > 他人即地狱 > 毁灭性吸积 > 乌号綦箭 > 意义质询 > 丰饶众生，一法界心
        > 戒律性闪变 > 大愿般若船 > 飞虹诛凿齿 > 轨道红移 > 甘露 > 完美体验：缄默 > 禳灾 > 液囊 > 永坍缩体 > 偏振受体
        > random
        """,

    "Remembrance": """
        完美体验：缄默 > 完美体验：浮黎 > 完美体验：纯真 > 景星助狩月 > 湮灭回归不等式 > 火堆外的夜 > 极端体验：麻木不仁
        > 极端体验：不寒而栗 > 极端体验：头晕目眩 > 体验：难言的羞耻 > 极端体验：多愁善感 > 极端体验：沦浃肌髓 > 极端体验：特立独行
        > 体验：攀升的刺激 > 体验：疏离的煎熬 > 体验：决绝的痛恨 > 体验：原初的苦衷 > 体验：病痛的折磨 > 体验：回应的兴奋 > 体验：丢失的记忆
        > reset
        > 胜军 > 天棓步危 > 桑弧蓬矢 > 加持 > 不稳定带 > 孢夹 > 丰饶众生，一法界心 > 戒律性闪变 > 大愿般若船 > 飞虹诛凿齿 > 轨道红移
        > 甘露 > 星间构筑•回馈庇护 > 禳灾 > 液囊 > 永坍缩体 > 偏振受体 > 《冠军晚餐•猫的摇篮》 > 帝弓断空彻太清 > 云镝逐步离
        > 帝车超光所向捷 > 背生击死 > 背孤击虚 > 宝光烛日月 > 他人即地狱 > 毁灭性吸积 > 乌号綦箭 > 意义质询
        > random
        """,

    "Nihility": """
        被装在套子里的人 > 感官追奉者的葬礼 > 为何一切尚未消失 > 景星助狩月 > 湮灭回归不等式 > 自欺咖啡馆 > 开端与终结 > 漠视主义
        > 旷野的呼告 > 火堆外的夜 > 情绪舍离 > 存在的黄昏 > 无根据颂歌 > 他人即地狱 > 悲剧讲座 > 知觉迷墙 > 虚妄供品 > 日出之前
        > 意义质询 > 盲目视界
        > reset
        > 胜军 > 天棓步危 > 桑弧蓬矢 > 加持 > 不稳定带 > 孢夹 > 丰饶众生，一法界心 > 戒律性闪变 > 大愿般若船 > 飞虹诛凿齿 > 轨道红移
        > 甘露 > 星间构筑•回馈庇护 > 完美体验：缄默 > 禳灾 > 液囊 > 永坍缩体 > 偏振受体 > 《冠军晚餐•猫的摇篮》 > 帝弓断空彻太清
        > 云镝逐步离 > 帝车超光所向捷 > 宝光烛日月 > 毁灭性吸积 > 乌号綦箭
        > random
        """,

    "Abundance": """
        葳蕤繁祉，延彼遐龄 > 若罪若福，施诸愿印 > 丰饶众生，一法界心 > 景星助狩月 > 湮灭回归不等式 > 天人不动众 > 灭罪累生善 > 法雨
        > 慧海度慈航 > 大愿般若船 > 甘露 > 轨道红移 > 宝光烛日月 > 明澈琉璃身 > 愿印 > 胜军 > 加持 > 厌离邪秽苦 > 回生 > 禳灾
        > 延寿
        > reset
        > 天棓步危 > 桑弧蓬矢 > 不稳定带 > 孢夹 > 火堆外的夜 > 《冠军晚餐•猫的摇篮》 > 帝弓断空彻太清 > 云镝逐步离 > 帝车超光所向捷
        > 背生击死 > 背孤击虚 > 他人即地狱 > 毁灭性吸积 > 乌号綦箭 > 意义质询 > 戒律性闪变 > 飞虹诛凿齿 > 星间构筑•回馈庇护
        > 完美体验：缄默 > 液囊 > 永坍缩体 > 偏振受体
        > random
        """,

    "The_Hunt": """
        帝车超光所向捷 > 帝弓断空彻太清 > 景星助狩月 > 帝星君临制穹桑 > 湮灭回归不等式 > 天舟缴夙敌 > 序师执迟彝 > 流岚追孽物 > 彤弓素矰
        > 白矢决射御 > 云镝逐步离 > 乌号綦箭 > 电射牛斗 > 天棓步危 > 背生击死 > 背孤击虚 > 桑弧蓬矢 > 雷车动地 > 飞虹诛凿齿
        > reset
        > 胜军 > 加持 > 不稳定带 > 孢夹 > 丰饶众生，一法界心 > 戒律性闪变 > 大愿般若船 > 轨道红移 > 甘露 > 星间构筑•回馈庇护
        > 完美体验：缄默 > 禳灾 > 液囊 > 永坍缩体 > 偏振受体 > 火堆外的夜 > 《冠军晚餐•猫的摇篮》 > 宝光烛日月 > 他人即地狱
        > 毁灭性吸积 > 意义质询
        > random
        """,

    "Destruction": """
        寰宇热寂特征数 > 反物质非逆方程 > 湮灭回归不等式 > 景星助狩月 > 灾难性共振 > 戒律性闪变 > 递增性末日 > 毁灭性吸积 > 破坏性耀发
        > 预兆性景深 > 危害性余光 > 原生黑洞 > 轨道红移 > 不稳定带 > 偏振受体 > 永坍缩体 > 回光效应 > 哨戒卫星 > 储备度规
        > reset
        > 胜军 > 天棓步危 > 桑弧蓬矢 > 加持 > 孢夹 > 丰饶众生，一法界心 > 大愿般若船 > 飞虹诛凿齿 > 甘露 > 星间构筑•回馈庇护
        > 完美体验：缄默 > 禳灾 > 液囊 > 火堆外的夜 > 《冠军晚餐•猫的摇篮》 > 帝弓断空彻太清 > 云镝逐步离 > 帝车超光所向捷 > 背生击死
        > 背孤击虚 > 宝光烛日月 > 他人即地狱 > 乌号綦箭 > 意义质询
        > random
        """,

    "Elation": """
        《自动口琴•茫茫白夜》 > 《四号屠场•众生安眠》 > 《冠军晚餐•猫的摇篮》 > 景星助狩月 > 湮灭回归不等式 > 《流吧，你的眼泪》
        > 《燃烧男子的肖像》 > 《被涂污的信天翁》 > 《十二猴子与怒汉》 > 《第二十一条军规》 > 《利尔他引力之虹》 > 《砂时镜下的幼园》
        > 《操行满分》 > 《阴风阵阵》 > 《灰暗的火》 > 《基本有害》 > 《回灯塔去》 > 《发条苹果》 > 《奇爱医生》 > 《铂金时代》
        > reset
        > 胜军 > 天棓步危 > 桑弧蓬矢 > 加持 > 不稳定带 > 孢夹 > 丰饶众生，一法界心 > 戒律性闪变 > 大愿般若船 > 飞虹诛凿齿 > 轨道红移
        > 甘露 > 星间构筑•回馈庇护 > 完美体验：缄默 > 禳灾 > 液囊 > 永坍缩体 > 偏振受体 > 火堆外的夜 > 帝弓断空彻太清 > 云镝逐步离
        > 帝车超光所向捷 > 背生击死 > 背孤击虚 > 宝光烛日月 > 他人即地狱 > 毁灭性吸积 > 乌号綦箭 > 意义质询
        > random
        """,

    "Propagation": """
        子囊释放 > 镰刀肢足 > 菌种脓疱 > 景星助狩月 > 湮灭回归不等式 > 腐殖疮 > 裂解酶 > 代谢腔 > 裸脑质 > 骨刃 > 节间膜
        > 催化剂 > 槽针 > 脊刺 > 兴奋腺 > 鳞翅 > 孢夹 > 液囊 > 结膜 > 复眼
        > reset
        > 胜军 > 天棓步危 > 桑弧蓬矢 > 加持 > 不稳定带 > 丰饶众生，一法界心 > 戒律性闪变 > 大愿般若船 > 飞虹诛凿齿 > 轨道红移 > 甘露
        > 星间构筑•回馈庇护 > 完美体验：缄默 > 禳灾 > 永坍缩体 > 偏振受体 > 火堆外的夜 > 《冠军晚餐•猫的摇篮》 > 帝弓断空彻太清
        > 云镝逐步离 > 帝车超光所向捷 > 背生击死 > 背孤击虚 > 宝光烛日月 > 他人即地狱 > 毁灭性吸积 > 乌号綦箭 > 意义质询
        > random
        """,

}
RESONANCE_PRESET = {
    "Preservation": "回响构音：均晶转变 > 回响构音：零维强化 > 回响构音：共晶反应 > random",
    "Remembrance": "回响构音：第二次初恋 > 回响构音：体验的富翁 > 回响构音：全面回忆 > random",
    "Nihility": "回响构音：局外人 > 回响构音：怀疑的四重根 > 回响构音：苦难与阳光 > random",
    "Abundance": "回响构音：诸法无我 > 回响构音：诸行无常 > 回响构音：无余涅槃 > random",
    "The_Hunt": "回响构音：射不主皮 > 回响构音：柘弓危矢 > 回响构音：狩星巡日 > random",
    "Destruction": "回响构音：激变变星 > 回响构音：极端氦闪 > 回响构音：事件视界 > random",
    "Elation": "回响构音：末日狂欢 > 回响构音：树苗长高舞 > 回响构音：开盖有奖 > random",
    "Propagation": "回响构音：结晶螯刺 > 回响构音：酚类物质 > 回响构音：刺吸口器 > random",
}
CURIO_PRESET = {
    "Preservation": """
        存护火漆 > 人造陨石球 > 空无烛剪 > 降维骰子 > 福灵胶 > 时空棱镜 > 测不准匣 > 万象无常骰 > 信标着色剂 > 星际大乐透
        > 跃迁复眼 > 博士之袍 > 纯美之袍 > 俱乐部券 > 分裂金币 > 龋齿星系模型 > 分裂银币 > 混沌云芝 > 黑洞之阱 > 万识囊
        > 混沌特效灵药 > 家族缘结 > 虚构机兵 > 异木果实 > 香涎干酪 > 永不停嘴的羊皮卷 > 信仰债券 > 湮灭烛剪 > 天外重声大碟 > 碎星芳饵
        > 换境桂冠 > 朋克洛德精神 > 鲁珀特帝国机械齿轮 > 闪耀的偏方三八面骰 > 分裂咕咕钟 > 机械咕咕钟 > 卜筮咕咕钟 > 黑森林咕咕钟
        > 永动咕咕钟 > 公司咕咕钟 > 银河大乐透 > 天才俱乐部普通八卦 > 愚者面具
        > random
        """,

    "Remembrance": """
        记忆火漆 > 人造陨石球 > 空无烛剪 > 降维骰子 > 福灵胶 > 时空棱镜 > 测不准匣 > 万象无常骰 > 信标着色剂 > 星际大乐透
        > 跃迁复眼 > 博士之袍 > 纯美之袍 > 俱乐部券 > 分裂金币 > 龋齿星系模型 > 分裂银币 > 混沌云芝 > 黑洞之阱 > 万识囊
        > 混沌特效灵药 > 家族缘结 > 虚构机兵 > 异木果实 > 香涎干酪 > 永不停嘴的羊皮卷 > 信仰债券 > 湮灭烛剪 > 天外重声大碟 > 碎星芳饵
        > 换境桂冠 > 朋克洛德精神 > 鲁珀特帝国机械齿轮 > 闪耀的偏方三八面骰 > 分裂咕咕钟 > 机械咕咕钟 > 卜筮咕咕钟 > 黑森林咕咕钟
        > 永动咕咕钟 > 公司咕咕钟 > 银河大乐透 > 天才俱乐部普通八卦 > 愚者面具
        > random
        """,

    "Nihility": """
        虚无火漆 > 人造陨石球 > 空无烛剪 > 降维骰子 > 福灵胶 > 时空棱镜 > 测不准匣 > 万象无常骰 > 信标着色剂 > 星际大乐透
        > 跃迁复眼 > 纯美之袍 > 俱乐部券 > 分裂金币 > 龋齿星系模型 > 分裂银币 > 混沌云芝 > 黑洞之阱 > 万识囊 > 博士之袍
        > 混沌特效灵药 > 家族缘结 > 虚构机兵 > 异木果实 > 香涎干酪 > 永不停嘴的羊皮卷 > 信仰债券 > 湮灭烛剪 > 天外重声大碟 > 碎星芳饵
        > 换境桂冠 > 朋克洛德精神 > 鲁珀特帝国机械齿轮 > 闪耀的偏方三八面骰 > 分裂咕咕钟 > 机械咕咕钟 > 卜筮咕咕钟 > 黑森林咕咕钟
        > 永动咕咕钟 > 公司咕咕钟 > 银河大乐透 > 天才俱乐部普通八卦 > 愚者面具
        > random
        """,

    "Abundance": """
        丰饶火漆 > 人造陨石球 > 空无烛剪 > 降维骰子 > 福灵胶 > 时空棱镜 > 测不准匣 > 万象无常骰 > 信标着色剂 > 星际大乐透
        > 跃迁复眼 > 纯美之袍 > 俱乐部券 > 分裂金币 > 龋齿星系模型 > 分裂银币 > 混沌云芝 > 黑洞之阱 > 万识囊 > 博士之袍
        > 混沌特效灵药 > 家族缘结 > 虚构机兵 > 异木果实 > 香涎干酪 > 永不停嘴的羊皮卷 > 信仰债券 > 湮灭烛剪 > 天外重声大碟 > 碎星芳饵
        > 换境桂冠 > 朋克洛德精神 > 鲁珀特帝国机械齿轮 > 闪耀的偏方三八面骰 > 分裂咕咕钟 > 机械咕咕钟 > 卜筮咕咕钟 > 黑森林咕咕钟
        > 永动咕咕钟 > 公司咕咕钟 > 银河大乐透 > 天才俱乐部普通八卦 > 愚者面具
        > random
        """,

    "The_Hunt": """
        巡猎火漆 > 人造陨石球 > 空无烛剪 > 降维骰子 > 福灵胶 > 时空棱镜 > 测不准匣 > 万象无常骰 > 信标着色剂 > 星际大乐透
        > 跃迁复眼 > 博士之袍 > 纯美之袍 > 俱乐部券 > 分裂金币 > 龋齿星系模型 > 分裂银币 > 混沌云芝 > 黑洞之阱 > 万识囊
        > 混沌特效灵药 > 家族缘结 > 虚构机兵 > 异木果实 > 香涎干酪 > 永不停嘴的羊皮卷 > 信仰债券 > 湮灭烛剪 > 天外重声大碟 > 碎星芳饵
        > 换境桂冠 > 朋克洛德精神 > 鲁珀特帝国机械齿轮 > 闪耀的偏方三八面骰 > 分裂咕咕钟 > 机械咕咕钟 > 卜筮咕咕钟 > 黑森林咕咕钟
        > 永动咕咕钟 > 公司咕咕钟 > 银河大乐透 > 天才俱乐部普通八卦 > 愚者面具
        > random
        """,

    "Destruction": """
        毁灭火漆 > 人造陨石球 > 空无烛剪 > 降维骰子 > 福灵胶 > 时空棱镜 > 测不准匣 > 万象无常骰 > 信标着色剂 > 星际大乐透
        > 跃迁复眼 > 博士之袍 > 纯美之袍 > 俱乐部券 > 分裂金币 > 龋齿星系模型 > 分裂银币 > 混沌云芝 > 黑洞之阱 > 万识囊
        > 混沌特效灵药 > 家族缘结 > 虚构机兵 > 异木果实 > 香涎干酪 > 永不停嘴的羊皮卷 > 信仰债券 > 湮灭烛剪 > 天外重声大碟 > 碎星芳饵
        > 换境桂冠 > 朋克洛德精神 > 鲁珀特帝国机械齿轮 > 闪耀的偏方三八面骰 > 分裂咕咕钟 > 机械咕咕钟 > 卜筮咕咕钟 > 黑森林咕咕钟
        > 永动咕咕钟 > 公司咕咕钟 > 银河大乐透 > 天才俱乐部普通八卦 > 愚者面具
        > random
        """,

    "Elation": """
        欢愉火漆 > 人造陨石球 > 空无烛剪 > 降维骰子 > 福灵胶 > 时空棱镜 > 测不准匣 > 万象无常骰 > 信标着色剂 > 星际大乐透
        > 跃迁复眼 > 博士之袍 > 纯美之袍 > 俱乐部券 > 分裂金币 > 龋齿星系模型 > 分裂银币 > 混沌云芝 > 黑洞之阱 > 万识囊
        > 混沌特效灵药 > 家族缘结 > 虚构机兵 > 异木果实 > 香涎干酪 > 永不停嘴的羊皮卷 > 信仰债券 > 湮灭烛剪 > 天外重声大碟 > 碎星芳饵
        > 换境桂冠 > 朋克洛德精神 > 鲁珀特帝国机械齿轮 > 闪耀的偏方三八面骰 > 分裂咕咕钟 > 机械咕咕钟 > 卜筮咕咕钟 > 黑森林咕咕钟
        > 永动咕咕钟 > 公司咕咕钟 > 银河大乐透 > 天才俱乐部普通八卦 > 愚者面具
        > random
        """,

    "Propagation": """
        繁育火漆 > 人造陨石球 > 空无烛剪 > 降维骰子 > 福灵胶 > 时空棱镜 > 测不准匣 > 万象无常骰 > 信标着色剂 > 星际大乐透
        > 跃迁复眼 > 纯美之袍 > 俱乐部券 > 分裂金币 > 龋齿星系模型 > 分裂银币 > 混沌云芝 > 黑洞之阱 > 万识囊 > 博士之袍
        > 混沌特效灵药 > 家族缘结 > 虚构机兵 > 异木果实 > 香涎干酪 > 永不停嘴的羊皮卷 > 信仰债券 > 湮灭烛剪 > 天外重声大碟 > 碎星芳饵
        > 换境桂冠 > 朋克洛德精神 > 鲁珀特帝国机械齿轮 > 闪耀的偏方三八面骰 > 分裂咕咕钟 > 机械咕咕钟 > 卜筮咕咕钟 > 黑森林咕咕钟
        > 永动咕咕钟 > 公司咕咕钟 > 银河大乐透 > 天才俱乐部普通八卦 > 愚者面具
        > random
        """,

}