{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-0_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-0_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-0", 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-0", 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-0-1x1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-0-1x1_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-0-1x1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-0-1x1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-0-1x1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-0-1x1_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-0-1x1_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-0-1x1", 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-0-1x1", 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool-0_m", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool-0_a", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus0", 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool-1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-2_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-2_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-2", 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0], [28, 0, 1], [29, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-2", 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-2-1x1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-2-1x1_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-2-1x1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-2-1x1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-2-1x1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-2-1x1_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-2-1x1_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-2-1x1", 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 1], [38, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-2-1x1", 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-3_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-3_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-3", 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 1], [47, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-3", 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-3-1x1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-3-1x1_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-3-1x1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-3-1x1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-3-1x1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-3-1x1_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-3-1x1_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-3-1x1", 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0], [55, 0, 1], [56, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-3-1x1", 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool-2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-4_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-4_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-4_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-4_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-4_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-4_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-4", 
      "inputs": [[62, 0, 0], [63, 0, 0], [64, 0, 0], [65, 0, 1], [66, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-4", 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-4-1x1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-4-1x1_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-4-1x1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-4-1x1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-4-1x1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-4-1x1_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-4-1x1_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-4-1x1", 
      "inputs": [[71, 0, 0], [72, 0, 0], [73, 0, 0], [74, 0, 1], [75, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-4-1x1", 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-5_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-5_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-5", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-5_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-5_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-5_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-5_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-5", 
      "inputs": [[80, 0, 0], [81, 0, 0], [82, 0, 0], [83, 0, 1], [84, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-5", 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-5-1x1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-5-1x1_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-5-1x1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-5-1x1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-5-1x1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-5-1x1_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-5-1x1_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-5-1x1", 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0], [92, 0, 1], [93, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-5-1x1", 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attrs": {
        "kernel": "(4, 1)", 
        "pool_type": "avg"
      }, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "squeeze", 
      "name": "squeeze0", 
      "attrs": {"axis": "2"}, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attrs": {"axes": "(2, 0, 1)"}, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm0_l0_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "lstm0_reshape0", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm0_l0_h2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400, 100)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "lstm0_reshape1", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm0_r0_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "lstm0_reshape2", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm0_r0_h2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400, 100)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "lstm0_reshape3", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm0_l1_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400, 200)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "lstm0_reshape4", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm0_l1_h2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400, 100)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "lstm0_reshape5", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm0_r1_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400, 200)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "lstm0_reshape6", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm0_r1_h2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400, 100)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "lstm0_reshape7", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm0_l0_i2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "lstm0_reshape8", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm0_l0_h2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "lstm0_reshape9", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm0_r0_i2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "lstm0_reshape10", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm0_r0_h2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "lstm0_reshape11", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm0_l1_i2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "lstm0_reshape12", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm0_l1_h2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "lstm0_reshape13", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm0_r1_i2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "lstm0_reshape14", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm0_r1_h2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "lstm0_reshape15", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "_rnn_param_concat", 
      "name": "lstm0__rnn_param_concat0", 
      "attrs": {
        "dim": "0", 
        "num_args": "16"
      }, 
      "inputs": [
        [101, 0, 0], 
        [103, 0, 0], 
        [105, 0, 0], 
        [107, 0, 0], 
        [109, 0, 0], 
        [111, 0, 0], 
        [113, 0, 0], 
        [115, 0, 0], 
        [117, 0, 0], 
        [119, 0, 0], 
        [121, 0, 0], 
        [123, 0, 0], 
        [125, 0, 0], 
        [127, 0, 0], 
        [129, 0, 0], 
        [131, 0, 0]
      ]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm0_lstm0_h0_0", 
      "attrs": {
        "__layout__": "LNC", 
        "dtype": "float32", 
        "shape": "(4, 0, 100)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_zeros", 
      "name": "lstm0_lstm0_h0_1", 
      "attrs": {
        "__layout__": "LNC", 
        "dtype": "float32", 
        "shape": "(4, 0, 100)"
      }, 
      "inputs": []
    }, 
    {
      "op": "RNN", 
      "name": "lstm0_rnn0", 
      "attrs": {
        "bidirectional": "True", 
        "lstm_state_clip_max": "None", 
        "lstm_state_clip_min": "None", 
        "lstm_state_clip_nan": "False", 
        "mode": "lstm", 
        "num_layers": "2", 
        "p": "0", 
        "projection_size": "None", 
        "state_outputs": "True", 
        "state_size": "100"
      }, 
      "inputs": [[99, 0, 0], [132, 0, 0], [133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(-3, -2)"}, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "pred_fc_weight", 
      "attrs": {"num_hidden": "6426"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "pred_fc_bias", 
      "attrs": {"num_hidden": "6426"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "pred_fc", 
      "attrs": {"num_hidden": "6426"}, 
      "inputs": [[136, 0, 0], [137, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation0", 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss1", 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad0", 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(-4, 35, -1, 0)"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "CTCLoss", 
      "name": "ctc_loss0", 
      "inputs": [[143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss0", 
      "inputs": [[145, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    23, 
    24, 
    26, 
    27, 
    28, 
    29, 
    32, 
    33, 
    35, 
    36, 
    37, 
    38, 
    41, 
    42, 
    44, 
    45, 
    46, 
    47, 
    50, 
    51, 
    53, 
    54, 
    55, 
    56, 
    60, 
    61, 
    63, 
    64, 
    65, 
    66, 
    69, 
    70, 
    72, 
    73, 
    74, 
    75, 
    78, 
    79, 
    81, 
    82, 
    83, 
    84, 
    87, 
    88, 
    90, 
    91, 
    92, 
    93, 
    100, 
    102, 
    104, 
    106, 
    108, 
    110, 
    112, 
    114, 
    116, 
    118, 
    120, 
    122, 
    124, 
    126, 
    128, 
    130, 
    137, 
    138, 
    144
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    115, 
    116, 
    117, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    168, 
    170, 
    171
  ], 
  "heads": [[142, 0, 0], [146, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10401]}
}