{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-0_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-0_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-0", 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-0", 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-1_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-1_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-1", 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-1", 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool-0", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-2_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-2_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-2", 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 1], [26, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-2", 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-3_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-3_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-3", 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 1], [35, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-3", 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool-1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-4-1-1x1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-4-1-1x1_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-4-1-1x1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-4-1", 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-4_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-4_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-4-2", 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-4-2-1x1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-4-2-1x1_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-4-2-1x1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-4_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-4_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-4_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-4_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-4", 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0], [52, 0, 1], [53, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-4", 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-5-1-1x1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-5-1-1x1_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-5-1-1x1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-5-1", 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-5_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-5_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-5", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-5-2", 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-5-2-1x1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-5-2-1x1_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-5-2-1x1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-5_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-5_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-5_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-5_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-5", 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 1], [70, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-5", 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[72, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool-2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 1)"
      }, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-6-1-1x1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-6-1-1x1_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-6-1-1x1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-6-1", 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-6_weight", 
      "attrs": {
        "kernel": "(4, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-6_bias", 
      "attrs": {
        "kernel": "(4, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-6", 
      "attrs": {
        "kernel": "(4, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)"
      }, 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-6-2", 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv-6-2-1x1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv-6-2-1x1_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv-6-2-1x1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "512", 
        "pad": "(0, 0)"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm-6_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-6_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-6_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm-6_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm-6", 
      "inputs": [[85, 0, 0], [86, 0, 0], [87, 0, 0], [88, 0, 1], [89, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu-6", 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "squeeze", 
      "name": "squeeze0", 
      "attrs": {"axis": "2"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attrs": {"axes": "(2, 0, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-fc_weight", 
      "attrs": {
        "flatten": "False", 
        "num_hidden": "200"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-fc_bias", 
      "attrs": {
        "flatten": "False", 
        "num_hidden": "200"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "seq-fc", 
      "attrs": {
        "flatten": "False", 
        "num_hidden": "200"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "seq-relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(-3, -2)"}, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "pred_fc_weight", 
      "attrs": {"num_hidden": "6426"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "pred_fc_bias", 
      "attrs": {"num_hidden": "6426"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "pred_fc", 
      "attrs": {"num_hidden": "6426"}, 
      "inputs": [[99, 0, 0], [100, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation0", 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss1", 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad0", 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(-4, 69, -1, 0)"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "CTCLoss", 
      "name": "ctc_loss0", 
      "inputs": [[106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss0", 
      "inputs": [[108, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    20, 
    21, 
    23, 
    24, 
    25, 
    26, 
    29, 
    30, 
    32, 
    33, 
    34, 
    35, 
    39, 
    40, 
    43, 
    44, 
    47, 
    48, 
    50, 
    51, 
    52, 
    53, 
    56, 
    57, 
    60, 
    61, 
    64, 
    65, 
    67, 
    68, 
    69, 
    70, 
    75, 
    76, 
    79, 
    80, 
    83, 
    84, 
    86, 
    87, 
    88, 
    89, 
    95, 
    96, 
    100, 
    101, 
    107
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    105, 
    106, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    125, 
    126
  ], 
  "heads": [[105, 0, 0], [109, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10600]}
}