name_to_slot_cn = {
    '丰壤农田': 4, '悠然牧场': 4, '沉石矿山': 4, '翠土林场': 4, '坠香果园': 4, '青芽苗圃': 2,
    '有鱼餐馆': 2, '白熊饮品': 2, '啾啾简餐': 2, '乌鱼烤肉': 2, '木料加工设备': 2, '工业生产设备': 2,
    '电子加工设备': 2, '手工制作设备': 2, '啾咖啡': 2
}

items_data_cn = {
    1: {
        1: '小麦', 2: '玉米', 3: '牧草', 4: '咖啡豆', 5: '大米', 6: '白菜',
        7: '土豆', 8: '大豆',
    },
    2: {
        1: '鸡蛋', 2: '鲜肉', 3: '牛奶', 4: '羊毛',
    },
    3: {
        1: '煤炭', 2: '铜矿', 3: '铝矿', 4: '铁矿', 5: '硫矿', 6: '银矿',
    },
    4: {
        1: '自然之木', 2: '实用之木', 3: '精选之木', 4: '典雅之木',
    },
    5: {
        1: '秋月梨', 2: '柿子', 3: '苹果', 4: '柑橘', 5: '香蕉', 6: '芒果',
        7: '柠檬', 8: '牛油果', 9: '橡胶',
    },
    6: {
        1: '亚麻', 2: '草莓', 3: '棉花', 4: '茶叶', 5: '薰衣草', 6: '胡萝卜',
        7: '洋葱',
    },
    7: {
        1: '柿子饼', 2: '松茸鸡汤', 3: '豆腐', 4: '肉末烧豆腐', 5: '蛋包饭',
        6: '白菜豆腐汤', 7: '蔬菜沙拉', 8: '经典豆腐套餐', 9: '绵玉定食',
    },
    8: {
        1: '胡萝卜秋梨汁', 2: '菊花茶', 3: '苹果汁', 4: '香蕉芒果汁',
        5: '蜂蜜柠檬水', 6: '草莓蜜沁', 7: '薰衣草茶', 8: '草莓蜂蜜冰沙',
        9: '阳光蜜水', 10: '花香果韵', 11: '缤纷果乐园',
    },
    9: {
        1: '玉米杯', 2: '苹果派', 3: '香橙派', 4: '芒果糯米饭', 5: '香蕉可丽饼',
        6: '草莓夏洛特', 7: '香甜组合', 8: '果园二重奏', 9: '莓果香橙甜点组',
    },
    10: {
        1: '炭烤肉串', 2: '禽肉土豆拼盘', 3: '爆炒禽肉', 4: '胡萝卜厚蛋烧',
        5: '汉堡肉饭', 6: '烤肉狂欢', 7: '能量双拼套餐',
    },
    11: {
        1: '纸张', 2: '记事本', 3: '桌椅', 4: '精选木桶', 5: '文件柜',
    },
    12: {
        1: '炭笔', 2: '铁钉', 3: '电缆', 4: '硫酸', 5: '火药', 6: '刀叉餐具',
    },
    13: {
        1: '墨盒', 2: '钟表', 3: '蓄电池', 4: '净水滤芯',
    },
    14: {
        1: '秋季花束', 2: '花生油', 3: '布料', 4: '皮革', 5: '绳索', 6: '手套',
        7: '香囊', 8: '鞋靴', 9: '绷带',
    },
    15: {
        1: '欧姆蛋', 2: '冰咖啡', 3: '芝士', 4: '拿铁', 5: '柑橘咖啡',
        6: '草莓奶绿', 7: '晨光活力组合', 8: '醒神套餐', 9: '果香双杯乐',
    },
}
